app/controllers/pages_controller.rb

SELECT "users".* FROM "users" ORDER BY id DESC
---
  def index
    @users = User.all.order("id ASC")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
  def role_update
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 45], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 35]]
---
  def user_delete
    @user = User.find(params[:id])
    authorize! :index, @user
    @user.destroy