app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hola"], ["content", "primer post"], ["user_id", 1], ["created_at", "2019-09-06 23:38:11.905341"], ["updated_at", "2019-09-06 23:38:11.905341"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "cada uno come pizza"], ["updated_at", "2019-09-07 14:40:30.898432"], ["id", 34]]